cfd/legendSedan_f45/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

latestTime      1800;

startTime       1965;

stopAt          endTime;

endTime         2500;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //

functions
{
   // #include "streamLines"
   // #include "wallBoundedStreamLines"
   // #include "cuttingPlane"
    #include "forceCoeffs"
   // #include "ensightWrite"         // ??? CAPIRE COSA FA ??? - eMecc non la usano

    solverInfo
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        fields          (U p k omega);
        writeResidualFields no;
    }

    yplus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl    outputTime;
    }

    // eMecc calcolano tante altre cose... chiedere ad Ali maybe
}


// ************************************************************************* //
